tutorials/multiphaseEuler/fluidisedBedLaminar/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.air       1;
    alpha.particles 0;
}

zones
{
    bed
    {
        type        box;
        zoneType    cell;

        box         (0 0 -0.1) (0.15 0.5 0.1);

        values
        {
            alpha.air       0.45;
            alpha.particles 0.55;
        }
    }
}


// ************************************************************************* //
